# Prot_GetDistribCode

## Description
Returns the distributor code.

```pascal
FUNCTION Prot_GetDistribCode : STRING;
```

```python
def vs.Prot_GetDistribCode():
    return STRING
```

## Examples
```pascal
resultStr := Prot_GetDistribCode;
```
```python
import vs

# Returns the distributor code.
text = vs.Prot_GetDistribCode()
vs.Message('Prot_GetDistribCode returned: ' + str(text))
```

## Version
Availability: from Vectorworks 2023

## Category
* Protection